In [41]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import MinMaxScaler

In [27]:
data = {
    'ID':   [1, 2, 3, 4, 5, 6,  7,   8,   9,  10, 11,  12,  13,  14, 15],
    'Name': ["A","B","c", np.nan,"D","E", np.nan,"F", "G", "H", "I", "J", np.nan,"K", "L"],
    'Age':  [20, 30, 40, 50, np.nan, 25, np.nan, 35, 45, np.nan, 22, 28, 33, np.nan, 41],
    'City': ["Delhi","Mumbai", np.nan,"Chennai","Pune", np.nan,"Kolkata","Bengaluru","Hyderabad","Delhi", 
             "Pune", np.nan,"Jaipur","Mumbai", "Chennai"],
    'Score':[85.0, np.nan, 72.5, 90.0, 66.0, np.nan, 78.0, np.nan, 88.5, 74.0, 
             np.nan, 69.0, 80.0, 92.0, np.nan]
}
df = pd.DataFrame(data)

In [28]:
print(data)

{'ID': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15], 'Name': ['A', 'B', 'c', nan, 'D', 'E', nan, 'F', 'G', 'H', 'I', 'J', nan, 'K', 'L'], 'Age': [20, 30, 40, 50, nan, 25, nan, 35, 45, nan, 22, 28, 33, nan, 41], 'City': ['Delhi', 'Mumbai', nan, 'Chennai', 'Pune', nan, 'Kolkata', 'Bengaluru', 'Hyderabad', 'Delhi', 'Pune', nan, 'Jaipur', 'Mumbai', 'Chennai'], 'Score': [85.0, nan, 72.5, 90.0, 66.0, nan, 78.0, nan, 88.5, 74.0, nan, 69.0, 80.0, 92.0, nan]}

In [35]:
print("Missing values in each column")
df.isnull().sum()

Missing values in each column

ID       0
Name     3
Age      4
City     3
Score    5
dtype: int64

In [30]:
df.describe()

              ID        Age      Score
count  15.000000  11.000000  10.000000
mean    8.000000  33.545455  79.500000
std     4.472136   9.668129   9.140873
min     1.000000  20.000000  66.000000
25%     4.500000  26.500000  72.875000
50%     8.000000  33.000000  79.000000
75%    11.500000  40.500000  87.625000
max    15.000000  50.000000  92.000000

In [31]:
df_dropped_rows = df.dropna()
print(df_dropped_rows)

   ID Name   Age       City  Score
0   1    A  20.0      Delhi   85.0
8   9    G  45.0  Hyderabad   88.5

In [36]:
print("Missing values in each column")
df.isnull().sum()

Missing values in each column

ID       0
Name     3
Age      4
City     3
Score    5
dtype: int64

In [33]:
df_dropped_cols = df.dropna(axis=1)
print(df_dropped_cols)

    ID
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9   10
10  11
11  12
12  13
13  14
14  15

In [34]:
print(df.isnull().sum())

ID       0
Name     3
Age      4
City     3
Score    5
dtype: int64

In [39]:
# df_filled = df.fillna({'Age':df['Age'].mean(),'City':'Unknown','Salary':})
df = df.fillna({
    'Age': df['Age'].mean(),
    'City': 'Unknown',
    'Salary': 0
})
print(df_filled)

    ID Name        Age       City  Score
0    1    A  20.000000      Delhi   85.0
1    2    B  30.000000     Mumbai    NaN
2    3    c  40.000000    Unknown   72.5
3    4  NaN  50.000000    Chennai   90.0
4    5    D  33.545455       Pune   66.0
5    6    E  25.000000    Unknown    NaN
6    7  NaN  33.545455    Kolkata   78.0
7    8    F  35.000000  Bengaluru    NaN
8    9    G  45.000000  Hyderabad   88.5
9   10    H  33.545455      Delhi   74.0
10  11    I  22.000000       Pune    NaN
11  12    J  28.000000    Unknown   69.0
12  13  NaN  33.000000     Jaipur   80.0
13  14    K  33.545455     Mumbai   92.0
14  15    L  41.000000    Chennai    NaN

In [40]:
print(df.isnull().sum())

ID       0
Name     3
Age      0
City     0
Score    5
dtype: int64